//РџРѕРґРіСЂСѓР¶Р°РµРјС‹Рµ РјРѕРґСѓР»Рё РѕС‚СЃСѓС‚СЃС‚РІСѓСЋС‚
//int NZER_N_B(int n), РіРґРµ n РїСЂРѕРІРµСЂСЏРµРјРѕРµ С†РµР»РѕРµ С‡РёСЃР»Рѕ
//Р’РѕР·РІСЂР°С‰Р°РµС‚СЃСЏ (1), РµСЃР»Рё С‡РёСЃР»Рѕ РЅРµ СЂР°РІРЅРѕ "0", РёРЅР°С‡Рµ РІРѕР·РІСЂР°С‰Р°РµС‚СЃСЏ (0)
//Р’РµСЂРµС‚РµРЅРЅРёРєРѕРІ, РўР°Р±Р°РєРѕРІ - 4306
int NZER_N_B(int n, int *A)
{
  int check=0, i;  //Инициализация переменных
  for(i=0; i<n+1 && !A[i]; i++); //Цикл идёт пока не достигнут конец или элемент не равен нулю
  if(A[i])
    check=1; //Если в числе есть цифра не равная нулю, устанавливаем флаг в значение 1
  return check;
}
